---
kind: method
id: M:Autodesk.Revit.DB.LayerModifier.Dispose
source: html/afd9ae4c-fbe6-eb00-f90d-9b4d1034e5ca.htm
---
# Autodesk.Revit.DB.LayerModifier.Dispose Method

Releases all resources used by the LayerModifier

## Syntax (C#)
```csharp
public void Dispose()
```